leetcode_465_optimal_account_balancing.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Leetcode: 465. Optimal Account Balancing</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="style.css">

</head>
<body>
<!--  --><nav><a href="index.html">Problem Solving</a></nav><div id="content" class="content">
<h1 class="title">Leetcode: 465. Optimal Account Balancing</h1>
<ul class="org-ul">
<li><a href="is_there_an_alternative_problem_easier_to_solve.html#ID-64E7E55B-09A9-4022-AB5E-1D25FC64EAC9">Is there an alternative problem easier to solve?</a>  Create an array \(b\) that represents the balance after all transactions.  We have that \(sum(b)\) is 0 and represents how much each one needs to receive or send.  The problem becomes find the minimum number of transactions to make all balances equal to zero.  Time complexity is \(O(n \times 2^n)\) since each there are \(2^n\) possible open balances and you need to process \(n\) possible ways to send/receive money.</li>
</ul>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">from</span> typing <span style="font-weight: bold;">import</span> List


<span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">Solution</span>:
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">minTransfers</span>(<span style="font-weight: bold;">self</span>, transactions: List[List[<span style="font-weight: bold;">int</span>]]) -&gt; <span style="font-weight: bold;">int</span>:
        ans = <span style="font-weight: bold;">len</span>(transactions)

        <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">dfs</span>(i):
            <span style="font-weight: bold;">if</span> i == 12:
                <span style="font-weight: bold;">return</span> 0
            <span style="font-weight: bold;">if</span> net[i] == 0:
                <span style="font-weight: bold;">return</span> dfs(i + 1)
            ans = 8
            <span style="font-weight: bold;">for</span> j <span style="font-weight: bold;">in</span> <span style="font-weight: bold;">range</span>(i + 1, 12):
                <span style="font-weight: bold;">if</span> (
                    net[j] == 0
                    <span style="font-weight: bold;">or</span> (net[i] &lt; 0 <span style="font-weight: bold;">and</span> net[j] &lt; 0)
                    <span style="font-weight: bold;">or</span> (net[i] &gt; 0 <span style="font-weight: bold;">and</span> net[j] &gt; 0)
                ):
                    <span style="font-weight: bold;">continue</span>
                tmp = net[j]
                net[i] += tmp
                net[j] = 0
                ans = <span style="font-weight: bold;">min</span>(ans, 1 + dfs(i))
                net[i] -= tmp
                net[j] = tmp
            <span style="font-weight: bold;">return</span> ans

        net = [0] * 12
        <span style="font-weight: bold;">for</span> f, t, a <span style="font-weight: bold;">in</span> transactions:
            net[f] -= a
            net[t] += a

        <span style="font-weight: bold;">return</span> dfs(0)


<span style="font-weight: bold;">assert</span> Solution().minTransfers([[0, 1, 10], [2, 0, 5]]) == 2
<span style="font-weight: bold;">assert</span> Solution().minTransfers([[0, 1, 10], [1, 0, 1], [1, 2, 5], [2, 0, 5]]) == 1
</pre>
</div>
</div>
</body>
</html>